ParProg.org
#+SETUPFILE: /Users/johannes/Documents/myOrg/org-html-themes/setup/theme-bigblow.setup

#+TITLE: Wahlpflichfach Parallelprogrammierung
#+AUTOR: Johannes Brauer
#+OPTIONS:   H:4


* Mögliche Themen
(Übersschriften aus verschiedenene Quellen gestohlen)

** Concurrency, Parallelism, and State
# chapter 4 in Clojure Programming
# Concurrency, Parallelism, and State. And Zombies in
# clojure-for-the-brave-and-true.pdf
# [[https://player.oreilly.com/videos/9781771375313]]
# Orchestrating Concurrency and Parallelism in MASTERING_CLOJURE.pdf
# Kap. 5 (State) in programming-clojure_p2_0.pdf
# Kap. 8 Concurrency and Parallelism in RUST_ESSENTIALS.pdf
# Kap. 11  Mutation in TheJoyofClojure.pdf
# 11 [[file:/Applications/Entwicklung/Racket%2520v6.9/doc/reference/concurrency.html][Concurrency and Parallelism]] in Racket Doku
*** Unterschied zwischen konkurrierenden und parallelen Prozessen
*** synchrone/asynchrone Prozesse
*** typische Probleme
*** Rechnerarchitekturen
** JVM Threads
*** Nutzung in
**** Java
**** Clojure 
**** ...
** Leichtgewichtige Tools für Parallelprogrammierung
*** Futures, Delays, and Promises
** Stateless Concurrency and Parallelism
*** Map/Reduce
** Funktional-reaktive Programmierung mit Java and Clojure
*** Nutzung von Quasar und Pulsar
** Spezialitäten
*** CUDA
*** ...
* „Interessante“ Programmiersprachen
+ Java
+ Clojure
+ Smalltalk
+ F#
+ Erlang / Elixir
+ Oz
+ Scala
+ Rust
* Art der Durchführung
** (kleiner) Einführungsteil (Vorlesung)
** Definition der Inhalte durch die Teilnehmer
** Erarbeitung und Präsentation von ausgewählten Themen durch die Teilnehmer
** kleine Projekte?
