ParProg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<!-- 2017-08-01 Tue 19:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wahlpflichfach Parallelprogrammierung</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Johannes Brauer" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Wahlpflichfach Parallelprogrammierung</h1>
<div id="table-of-contents">
<h2>Inhaltsverzeichnis</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org924c1e7">1. Mögliche Themen</a>
<ul>
<li><a href="#org769d443">1.1. Concurrency, Parallelism, and State</a>
<ul>
<li><a href="#orgad7fc76">1.1.1. Unterschied zwischen konkurrierenden und parallelen Prozessen</a></li>
<li><a href="#org8428751">1.1.2. synchrone/asynchrone Prozesse</a></li>
<li><a href="#orgd428a77">1.1.3. typische Probleme</a></li>
<li><a href="#orgf149f9b">1.1.4. Rechnerarchitekturen</a></li>
</ul>
</li>
<li><a href="#orgfe8372e">1.2. JVM Threads</a>
<ul>
<li><a href="#orga980f0a">1.2.1. Nutzung in</a>
<ul>
<li><a href="#org3323761">1.2.1.1. Java</a></li>
<li><a href="#orge60bdfd">1.2.1.2. Clojure</a></li>
<li><a href="#org2d08389">1.2.1.3. &#x2026;</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgffd08b0">1.3. Leichtgewichtige Tools für Parallelprogrammierung</a>
<ul>
<li><a href="#org786ecbb">1.3.1. Futures, Delays, and Promises</a></li>
</ul>
</li>
<li><a href="#orgbb11a92">1.4. Stateless Concurrency and Parallelism</a>
<ul>
<li><a href="#orge112766">1.4.1. Map/Reduce</a></li>
</ul>
</li>
<li><a href="#org659c39c">1.5. Funktional-reaktive Programmierung mit Java and Clojure</a>
<ul>
<li><a href="#org12730e0">1.5.1. Nutzung von Quasar und Pulsar</a></li>
</ul>
</li>
<li><a href="#org2e89a5c">1.6. Spezialitäten</a>
<ul>
<li><a href="#org057a3a8">1.6.1. CUDA</a></li>
<li><a href="#orgb4e35c7">1.6.2. &#x2026;</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0ec050b">2. Art der Durchführung</a>
<ul>
<li><a href="#org9f86c23">2.1. (kleiner) Einführungsteil (Vorlesung)</a></li>
<li><a href="#org29f775d">2.2. Definition der Inhalte durch die Teilnehmer</a></li>
<li><a href="#orgdb023cd">2.3. Erarbeitung und Präsentation von ausgewählten Themen durch die Teilnehmer</a></li>
<li><a href="#org91133cb">2.4. kleine Projekte?</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org924c1e7" class="outline-2">
<h2 id="org924c1e7"><span class="section-number-2">1</span> Mögliche Themen</h2>
<div class="outline-text-2" id="text-1">
<p>
(Übersschriften aus verschiedenene quellen gestohlen)
</p>
</div>

<div id="outline-container-org769d443" class="outline-3">
<h3 id="org769d443"><span class="section-number-3">1.1</span> Concurrency, Parallelism, and State</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgad7fc76" class="outline-4">
<h4 id="orgad7fc76"><span class="section-number-4">1.1.1</span> Unterschied zwischen konkurrierenden und parallelen Prozessen</h4>
</div>
<div id="outline-container-org8428751" class="outline-4">
<h4 id="org8428751"><span class="section-number-4">1.1.2</span> synchrone/asynchrone Prozesse</h4>
</div>
<div id="outline-container-orgd428a77" class="outline-4">
<h4 id="orgd428a77"><span class="section-number-4">1.1.3</span> typische Probleme</h4>
</div>
<div id="outline-container-orgf149f9b" class="outline-4">
<h4 id="orgf149f9b"><span class="section-number-4">1.1.4</span> Rechnerarchitekturen</h4>
</div>
</div>
<div id="outline-container-orgfe8372e" class="outline-3">
<h3 id="orgfe8372e"><span class="section-number-3">1.2</span> JVM Threads</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-orga980f0a" class="outline-4">
<h4 id="orga980f0a"><span class="section-number-4">1.2.1</span> Nutzung in</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><div id="outline-container-org3323761" class="outline-5">
<h5 id="org3323761"><span class="section-number-5">1.2.1.1</span> Java</h5>
</div>
<div id="outline-container-orge60bdfd" class="outline-5">
<h5 id="orge60bdfd"><span class="section-number-5">1.2.1.2</span> Clojure</h5>
</div>
<div id="outline-container-org2d08389" class="outline-5">
<h5 id="org2d08389"><span class="section-number-5">1.2.1.3</span> &#x2026;</h5>
</div>
</div>
</div>
<div id="outline-container-orgffd08b0" class="outline-3">
<h3 id="orgffd08b0"><span class="section-number-3">1.3</span> Leichtgewichtige Tools für Parallelprogrammierung</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-org786ecbb" class="outline-4">
<h4 id="org786ecbb"><span class="section-number-4">1.3.1</span> Futures, Delays, and Promises</h4>
</div>
</div>
<div id="outline-container-orgbb11a92" class="outline-3">
<h3 id="orgbb11a92"><span class="section-number-3">1.4</span> Stateless Concurrency and Parallelism</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-orge112766" class="outline-4">
<h4 id="orge112766"><span class="section-number-4">1.4.1</span> Map/Reduce</h4>
</div>
</div>
<div id="outline-container-org659c39c" class="outline-3">
<h3 id="org659c39c"><span class="section-number-3">1.5</span> Funktional-reaktive Programmierung mit Java and Clojure</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-org12730e0" class="outline-4">
<h4 id="org12730e0"><span class="section-number-4">1.5.1</span> Nutzung von Quasar und Pulsar</h4>
</div>
</div>
<div id="outline-container-org2e89a5c" class="outline-3">
<h3 id="org2e89a5c"><span class="section-number-3">1.6</span> Spezialitäten</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-org057a3a8" class="outline-4">
<h4 id="org057a3a8"><span class="section-number-4">1.6.1</span> CUDA</h4>
</div>
<div id="outline-container-orgb4e35c7" class="outline-4">
<h4 id="orgb4e35c7"><span class="section-number-4">1.6.2</span> &#x2026;</h4>
</div>
</div>
</div>
<div id="outline-container-org0ec050b" class="outline-2">
<h2 id="org0ec050b"><span class="section-number-2">2</span> Art der Durchführung</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org9f86c23" class="outline-3">
<h3 id="org9f86c23"><span class="section-number-3">2.1</span> (kleiner) Einführungsteil (Vorlesung)</h3>
</div>
<div id="outline-container-org29f775d" class="outline-3">
<h3 id="org29f775d"><span class="section-number-3">2.2</span> Definition der Inhalte durch die Teilnehmer</h3>
</div>
<div id="outline-container-orgdb023cd" class="outline-3">
<h3 id="orgdb023cd"><span class="section-number-3">2.3</span> Erarbeitung und Präsentation von ausgewählten Themen durch die Teilnehmer</h3>
</div>
<div id="outline-container-org91133cb" class="outline-3">
<h3 id="org91133cb"><span class="section-number-3">2.4</span> kleine Projekte?</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Johannes Brauer</p>
<p class="email">Email: <a href="mailto:brauer@nordakademie.de">brauer@nordakademie.de</a></p>
<p class="date">Created: 2017-08-01 Tue 19:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>